Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Python: добавлена поддержка Python 3.10.
en: Python: Python 3.10 support was added.

source: REST-запрос: Если в настройках подключения к REST-сервису явно указан допустимый Content-Type ответа, а в ответе сервиса заголовок Content-Type отсутствует, то на выходных портах узла REST-запрос не было ни данных, ни сообщения об ошибке.
en: REST request: If the allowable response Content-Type was explicitly specified in settings of connection to REST service, and there was no Content-Type header in the service response, neither data, nor error messages were at the output ports of REST request node.

source: REST-запрос: Если в настройках подключения к REST-сервису явно указан допустимый Content-Type ответа, а ответ получен с другим Content-Type, то все последующие ответы даже при правильном Content-Type содержали ошибку "Нераспознанная структура сообщения".
en: REST request: If the allowable response Content-Type was explicitly specified in settings of connection to REST service, and the response was received with another Content-Type, all subsequent responses contained "Unrecognized message structure" error even when Content-Type was correct.

source: REST-запрос: Если время ожидания сервиса превышало 30 секунд, то работа узла REST-запрос завершалась ошибкой "Ошибка при получении данных HTTP-клиентом:...
en: REST request: If the service timeout period exceeded 30 s, the work of REST request was terminated with the following error: "Error while receiving data by HTTP client:...

source: REST-запрос: Исправили ошибку "The process cannot access the file because it is being used by another process", которая могла возникать при параллельном вызове узла REST-запрос с активным параметром "Сохранять текст запроса на диск" (#6938).
en: REST request: "The process cannot access the file because it is being used by another process" error was corrected. It could occur in case of parallel calling of REST request node with active "Save request text on disk" parameter (#6938).

source: REST-запрос: Исправлена ошибка Access violation, которая возникала при выполнении запроса, возвращающего строку более 500 млн.
en: REST request: Access violation error was corrected. It occurred while executing the request returning the row exceeding 500 mln.

source: REST-запрос: При включенной опции "Сохранять текст запроса на диск" в файл записывались http заголовки запроса, генерируемые по умолчанию, а также тело запроса.
en: REST request: When "Save request text on disk" option was enabled, http request headers generated by default and request body were recorded in the file.

source: REST-запрос: Узел REST-запрос с настройками по умолчанию, первично активированный без предварительного входа в мастер настройки узла, не возвращал ответ.
en: REST request: REST request node with the default settings that was initially activated without initial node wizard login did not return the response.

source: SOAP-запрос: Исправлена ошибка "Не выбрана операция WSDL", которая возникала при перенастройке узла SOAP-запроса на другую операцию с тем же именем, но внутри другой службы или порта.
en: SOAP request: The following error was corrected: "No WSDL operation selected". It occurred when reconfiguring the SOAP request node to another operation with the same name but inside another service or port.

source: SQLite: Оптимизирована загрузка библиотеки sqlite.
en: SQLite: Sqlite library loading was optimised.

source: Автосохранение пакетов: пользователям, не имеющих права на редактирование пакетов, была доступна настройка автосохранения пакетов.
en: Auto save packages: The users that did not have rights to edit packages were allowed to configure packages auto saving.

source: Автосохранение пакетов: ранее мог возникать конфликт, иногда приводящий к невозможности надежного сохранения при одновременном автосохранении пакета и его закрытии через «Диспетчер».
en: Auto save packages: Previously, the conflict that sometimes made impossible to provide reliable saving while simultaneous package auto saving and closing via "Session Manager" could occur.

source: Администрирование: при открытии раздела Диспетчер панели администрирования могла возникать ошибка, в результате чего разделом нельзя было воспользоваться (#8257).
en: Administration: when opening the Session Manager section of the administration panel, an error could occur. It prevented from using the section (#8257).

source: Администрирование: при закрытии пакета или сессии пользователя через Диспетчер в панели Администрирования добавлен таймаут в 5 секунд.
en: Administration: when closing the package or user session using the Session Manager on the Administration bar, 5 s timeout was added.

source: Ассоциативные правила: Если при обучении узла возникала ошибка "Out of memory", то после изменения настроек и повторного обучения узла выходной порт оставался пустым, а при попытке выполнить узел появлялось сообщение, что узел не обучен.
en: Association rules: If "Out of memory" error occurred when training the node, after settings changing and repeated node training the output port remained empty, and while attempting to execute the node, a message appeared with information that the node was not trained.

source: Ассоциативные правила: Из-за ошибки округления могли быть отобраны не все правила, удовлетворяющие минимальной достоверности.
en: Association rules: Not all rules satisfying minimum reliability could be selected because of the rounding error.

source: Ассоциативные правила: Исправлена ошибка "Access violation", которая возникала, если на оба входа узла поданы большие наборы данных, выполнены настройки узла (заданы элементы и транзакции), а затем запущен и прерван процесс обучения узла (#10094).
en: Association rules: "Access violation" error was corrected. It occurred if large data sets were supplied to both node inputs, nodes were configured (elements and transactions were set) and then the node training process was started and terminated (#10094).

source: Быстрый просмотр: сочетания горячих клавиш для переключения между режимами просмотра «Таблица» и «Форма» изменены с «Alt + T» и «Alt + F» на «Alt + 1» и «Alt + 2» соответственно (#8137).
en: Quick view: hotkey combinations to switch between "Table" and "Form" view modes were changed from "Alt + T" and "Alt + F" to "Alt + 1" and "Alt + 2" correspondingly (#8137).

source: Быстрый просмотр: при изменении данных, подаваемых на вход подмодели, данные в Быстром просмотре узла, находящегося внутри подмодели, могли не обновиться.
en: Quick view: when changing the data supplied to the supernode input, the data in Quick view node in the supernode could not be updated.

source: Веб-приложение, Настольное приложение: если один из открытых пакетов был заблокирован, например, выполнялся один из его узлов, то при попытке на соседней вкладке закрыть не связанный с ним пакет возникало сообщение об ошибке «Сценарий содержит <…> заблокированных узлов» (#5735, #7608, #8131).
en: Web application, Desktop application: if one of the opened packages was locked, for example, one of its nodes was executed, while attempting to close the package that was not connected with it in the next tab, the following error message appeared: "Workflow contains <…> locked nodes" (#5735, #7608, #8131).

source: Веб-приложение, Настольное приложение: если файл открытого пакета был удален или перемещен, то при попытке закрыть такой пакет возникала ошибка «Cannot open file “<имя файла>”.
en: Web application, Desktop application: if the opened package file was removed or moved, the following error occurred while attempting to close such package: "Cannot open file “<file name>”.

source: Веб-приложение, Настольное приложение: актуализированы иконки социальных сетей, удалены ссылки на Instagram и Facebook (организации, деятельность которых запрещена на территории России) (#9253).
en: Web application, Desktop application: the social networks icons were actualized, links to Instagram and Facebook (the organizations activity of which is prohibited in the territory of the Russian Federation) were deleted (#9253).

source: Веб-приложение, Настольное приложение: после копирования узла сценария кнопка панели инструментов Вставить и аналогичный пункт контекстного меню в некоторых случаях оставались неактивными.
en: Web application, Desktop application: after copying the workflow node,Paste toolbar button and the similar context menu item were inactive in some cases.

source: Визуализатор «Диаграмма»: в Loginom 6.5.0 не работал экспорт диаграммы в формате «svg».
en: "Chart" visualizer: In Loginom 6.5.0 the chart export in "svg" format was not operable.

source: Визуализатор «Диаграмма»: восстановлена возможность горизонтального отображения диаграммы при нажатии кнопки «Горизонтальная ориентация» (#9001, #9097).
en: "Chart" visualizer: Horizontal chart display became possible when pressing on "Horizontal orientation" button (#9001, #9097).

source: Визуализатор «Диаграмма»: редакторы ссылок на поля всегда подсвечиваются красным, как ошибочные, если указана ссылка.
en: "Chart" visualizer: Field references editors were always highlighted in red as the incorrect ones if the reference was specified.

source: Визуализатор «Качество данных»: если в показателях выбрать все отключенные по умолчанию показатели (Минимум, Среднее, Уникально, Максимум, Медиана), нажать «Рассчитать статистики» и перейти на вкладку «Дискретные», то в отображаемой таблице отсутствовали ячейки с добавленными показателями, тогда как заголовки для них были.
en: "Data Quality" visualizer: If all indicators disabled by default were selected in the indicators (Minimum, Average, Unique, Maximum, Median), "Calculate statistics" was pressed and transfer to "Discrete" tab was performed, the cells with the added indicators were absent in the displayed table, whereas headers for them were available.

source: Визуализатор «Качество данных»: при нажатии на кнопку сплиттера панели детализации, которая в свернутом состоянии находится в нижней части окна, не загружалась панель.
en: "Data Quality" visualizer: When pressing on the splitter button of the detailing bar that was located in the lower part of the window in the collapsed state, the bar was not loaded.

source: Визуализатор «Качество данных»: исправлена ошибка в функции конвертирования целочисленных данных, из-за которой в некоторых случаях (например, если в наборе данных присутствовало 64-битное целое число) при расчете статистики пользователь мог получить сообщение "Overflow while converting variant of type..." (#9275).
en: "Data Quality" visualizer: the error in the integer data conversion function was corrected. Thus, in some cases (for example, if 64-bit integer was in the data set) when calculating statistics, a user could receive the following message: "Overflow while converting variant of type..." (#9275).

source: Визуализатор «Куб»: всем модальным окнам заданы минимальные размеры (#9098).
en: "Cube" visualizer: the minimum sizes are set for all modal windows (#9098).

source: Визуализатор «Куб»: при нажатии на кнопку сплиттера панели детализации, которая в свернутом состоянии находится в нижней части окна, не загружалась панель.
en: "Cube" visualizer: When pressing on the splitter button of the detailing bar that was located in the lower part of the window in the collapsed state, the bar was not loaded.

source: Визуализатор Диаграмма: Исправлены ошибки сохранения параметров диаграммы, из-за которых могли не сохраняться настройки масштабирования (#9445).
en: Chart Visualizer: The errors occurring in the process of the chart settings saving that caused inability to save scaling settings were corrected (#9445).

source: Визуализатор Диаграмма: Обновлена библиотека, которая используется для построения диаграммы.
en: Chart Visualizer: The library used for the chart construction was updated.

source: Визуализатор Диаграмма: При использовании в качестве поля абсцисс столбца, содержащего только null-значения, возникала ошибка "Номер строки XXXXXXXXXX вне диапазона [0; 13]" (#9127).
en: Chart Visualizer: When using the column that contained only null values as the abscissa field, the following error occurred: "Row number XXXXXXXXXX is out of [0; 13] range" (#9127).

source: Визуализатор Конечные классы: Добавили возможность менять ширину блока со списком полей (#9646).
en: Coarse сlasses visualizer: It became possible to change width of the block with the list of fields (#9646).

source: Визуализатор Куб: Фильтр по факту, в котором значение для сравнения указано как значение по умолчанию (0, "" и т.д.), т.е. не изменялось пользователем при его настройке, не срабатывал.
en: Cube visualizer: The filter by measure did not work. The compare value in it was specified as the default value (0, "" etc), namely, it was not changed by the user during its configuration.

source: Визуализатор Таблица: Для некоторых колонок из-за округления и разницы в 1 пиксель не срабатывал автоматический подбор ширины колонки по тексту заголовка.
en: Table visualizer: Auto selection of the column width by the header text didn't work for some columns due to rounding and difference in 1 pixel.

source: Визуализаторы, компоненты: Значение поля Время для даты 30.12.1899 содержало не только значение времени, но и дату.
en: Visualizers, components: The value of the Time field for 30.12.1899 contained not only the time value but also the date.

source: Замена: В мастере настройки узла Замена в случае изменения типа данных для значения Замена тип выходных столбцов не может быть однозначно определен, если параметр Заменять остальные не задан.
en: Replace: In Replace node wizard the output columns type cannot be explicitly defined in case of data type change for the Replace value if Replace others parameter is not set.

source: Замена: В мастере настройки узла Замена для способа замены Ввод вручную можно выполнить действие Получить уникальные значения и в редакторе значения замены выбрать значение из выпадающего списка.
en: Replace: In Replace node wizard for Manual entry replacement method, it is possible to perform the following action: Get unique values and select the value from the drop-down list in the replacement value editor.

source: Замена: Исправлена некорректная работа обработчика Замена, если таблица замен содержала дублирующие значения.
en: Replace: Incorrect operation of Replace handler was rectified if replacement table contained duplicate values.

source: Замена: При добавлении новой замены во внутреннюю таблицу замен для полей строкового и переменного типов в качестве значения по умолчанию используется <Пустая строка> вместо null-значения.
en: Replace: When addding the new replacement to the internal replacement table for the string and variable fields, <Empty string> is used as the default value instead of null-value.

source: Извлечение XML: Компонент Извлечение XML переименован в Разбор XML.
en: XML Extraction: Component XML Extraction was renamed to XML parsing.

source: Импорт из Deductor Warehouse, Экспорт в Deductor Warehouse: на странице мастера выбора объектов хранилища данных для ячеек добавлены подсказки, отображающие полное название объекта; добавлена возможность изменить ширину столбца, содержащего названия объектов (#8461).
en: Import from Deductor Warehouse, Export to Deductor Warehouse: the tips displaying full object name were added for the cells on the data warehouse objects selection wizard page. It also became possible to change the width of the column that contains the objects names (#8461).

source: Импорт из Deductor Warehouse: если при проектировании в Процесс включили несколько раз одно и то же Измерение и изменили метку, то в мастера импорта в дереве параметров эти Измерения имели одинаковые названия, при этом после переноса таких Измерений в область Полей, их подписи отображалась корректно (#8556).
en: Import from Deductor Warehouse: if one and the same Dimension was included into the Process several times, and the caption was changed while designing, these Dimensions had the same names in the import wizard in the parameters tree, when transferring such Dimensions to the Fields area, their caption texts were correctly displayed (#8556).

source: Импорт из Deductor Warehouse: при попытке выполнить ненастроенный узел импорта возникала неинформативная ошибка.
en: Import from Deductor Warehouse: while attempting to execute unconfigured import node, uninformative error occurred.

source: Импорт из Deductor Warehouse: у выходных столбцов отключена автоматическая инициализация «Назначения по умолчанию» на основе типов объектов хранилища данных.
en: Import from Deductor Warehouse: automatic initialization "Default usage types" based on the data warehouse objects types is disabled for the output columns.

source: Импорт из Excel-файла: Исправлено несколько ошибок, которые возникали на этапе настройки импорта из Excel-файла, при задании имени листа или именованного диапазона через переменную.
en: Import from Excel file: Several errors were corrected. They occurred at the stage of Import from Excel file configuration when setting the sheet name or named range by means of variable.

source: Импорт из Excel-файла: При использовании переменной в качестве значения параметра Выбор объекта после перехода ко второму шагу в мастере настройки возникала ошибка "Индекс листа Excel задан некорректно".
en: Import from Excel file: When using the variable as Select objectparameter value, the following error occurred when passing to the second stage in the wizard: "Excel sheet index was incorrectly set".

source: Импорт из LGD: В случае связывания полей разных типов с полем типа Переменный могла возникнуть ошибка: «Неподдерживаемый подтип типа Variant» (#8427).
en: Импорт из LGD: When connecting the fields related to different types with the field related to the Variable type, the following error could occur: "Unsupported Variant subtype" (#8427).

source: Импорт из Баз данных: при подключении к MS SQL Server с использованием ODBC драйвера, поля типа TinyInt ошибочно определялись, как имеющие неопределенный тип (#8183).
en: Import from Databases: when connecting to MS SQL Server using ODBC driver, the fields of the TinyInt type were incorrectly related to the undefined type (#8183).

source: Импорт из базы данных MS Access, Экспорт в базу данных MS Access: при импорте не работали SQL-запросы, содержащие параметры целого типа, а также нельзя было выполнить экспорт полей целого типа (#8422).
en: Import from MS Access Database, Export to MS Access Database: SQL queries that contained integer parameters were not operable while importing, and it was also not possible to export the integer fields (#8422).

source: Импорт из базы данных: В мастере настройки импорта из базы данных при кликах на имена полей и при перемещении по полям вверх/вниз с помощью клавиатуры сбрасывались выставленные ранее "галочки" около полей таблиц.
en: Import from database: Earlier selected checkboxes near the table fields were deselected in the import from database wizard while clicking on the field names and during up and down movements in the fields using the keyboard.

source: Импорт из базы данных: Если при активном подключении к базе данных открыть мастер импорта и сразу вызвать Предпросмотр, то выводилось сообщение с текстом: "Сначала выберите поля для предпросмотра".
en: Import from database: If import wizard was opened during the active connection to database and Preview was called, the following message was displayed: "First select the fields for preview".

source: Импорт из текстового файла: значение «По умолчанию» параметра «Ограничителя строк» переименовано в «Нет», что упростило восприятие.
en: Import from text file: "By default" value of "Text qualifier" parameter was renamed to "No" to simplify the perception.

source: Импорт из текстового файла: исключен тип данных «Неопределенный» из мастера настройки полей при импорте из текстового файла и «Excel».
en: Import from text file: The "Undefined" data type was excluded from the field wizard when importing from the text and "Excel" file.

source: Импорт из текстового файла: улучшен алгоритм автоматического определения структуры таблицы в текстовом файле.
en: Import from text file: Algorithm of the automatic definition of the table structure in the text file was improved.

source: Инспектор свойств: если был открыт Инспектор свойств и в нем отображались параметры Подмодели, то после разворачивания этой Подмодели в Инспекторе свойств продолжали отображаться параметры уже не существующего узла (#8313).
en: Property Inspector: if Property Inspector was opened and the Supernode parameters were selected in it, parameters of nonexistent node were still selected after expansion of this Supernode in the Property Inspector (#8313).

source: Инсталлятор: Инсталлятор Loginom Integrator не удалял веб-приложение, если оно было установлено на любой сайт, отличный от "Default Web Site".
en: Installer: Loginom Integrator installer did not delete the web application if it was installed on any site different from "Default Web Site".

source: Инсталлятор: При попытке установить Loginom Integrator с именем несуществующего сайта, работа инсталлятора преждевременно завершалась, а пользователь не получал никаких сообщений о причинах завершения установки.
en: Installer: While attempting to install Loginom Integrator with the name of nonexistent site, the installer operation was prematurely terminated, and the user received no messages concerning the reasons of installation termination.

source: Инсталлятор: Редактировать IP-адрес и порт сайта можно только при создании нового сайта.
en: Installer: It is possible to edit IP address and port of the site only when creating the new site.

source: Инсталлятор: Файл loginomd.socket перенесен в папку %ProgramData%\Loginom из подпапки %ProgramData%\Loginom\Server (#6640).
en: Installer: loginomd.socket file was transferred to %ProgramData%\Loginom folder from %ProgramData%\Loginom\Server subfolder (#6640).

source: Калькулятор: Вставка текста в редакторе кода выражения выполнялась не на текущую позицию курсора.
en: Calculator: Text in the expression code editor was pasted not to the current cursor position.

source: Калькулятор: Функции DateTimeToStr и DateToStr не возвращали результат, если необязательный параметр Format был равен "".
en: Calculator: DateTimeToStr and DateToStr functions didn't return the result if the optional Format parameter was equal to "".

source: Калькулятор: В мастере настройки узла актуализировали описание функции StrToDate.
en: Calculator: StrToDate function description was updated in the node wizard.

source: Калькулятор: Функции ArcSin и ArcCos выдавали неверный результат.
en: Calculator: ArcSin and ArcCos functions returned incorrect result.

source: Калькулятор: внесены исправления в работу функции RegExMatchedExp, которая в некоторых случаях могла выдать неверный результат (поиск регулярного выражения не начинался заново, если успешно найденная на предыдущем шаге строка была пустой) (#9310).
en: Calculator: operation of RegExMatchedExp function was corrected. In some cases misleading results could be obtained (search for the regular expression was not again started if the row successfully found at the previous step was empty) (#9310).

source: Конечные классы: Учтена ситуация, когда количество конечных классов равно 1.
en: Coarse сlasses: The situation when the coarse classes count was equal to 1 was taken into account.

source: Конечные классы: ошибка, возникавшая при обработке волатильного поля, например, полученного после «Калькулятора» при использовании функции «Random».
en: Coarse сlasses: The error that occurred while processing the volatile filed, for example, the one received after "Calculator" when using "Random" function.
